{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "use_bias": true, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [2, 2], "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [2, 2], "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 2048, "use_bias": true, "activation": "relu", "bias_constraint": null, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.36543976509722603, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 10, "use_bias": true, "activation": "softmax", "bias_constraint": null, "trainable": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}